const products = {
        robot_boxing_soccer: {
    name: "ربات‌ کنترلی بوکس و فوتبال",
    price: "۸,۸۰۰,۰۰۰ تومان",
    image: "../../images/Rechargeable_remote_controlled_boxing_robots_for_two_players.jpg",
    description: "دو ربات، یک میدان رقابت! 🤖⚽",
    link: "../../products/product/?id=robot_boxing_soccer",
    category: ["remote", "sport", "educational"],
    Inventory: "✓ موجود در انبار",

    shortDescription:
        "ست دو ربات کنترلی با قابلیت بازی بوکس و فوتبال، حرکت ۳۶۰ درجه، کنترل بی‌سیم ۲.۴ گیگاهرتز و باتری‌های قابل شارژ USB.",

    fullDescription:
        "این ست ربات‌های کنترلی یک بازی دونفره جذاب را با ترکیب مسابقه بوکس و فوتبال ارائه می‌دهد. 🤖" +
        "هر ربات با کنترل بی‌سیم ۲.۴ گیگاهرتز هدایت می‌شود و قابلیت حرکت چندجهته و چرخش ۳۶۰ درجه دارد." +
        "باتری‌های قابل شارژ USB نیز استفاده از ربات‌ها را راحت‌تر می‌کنند و وجود توپ و دروازه‌ها امکان بازی فوتبال را در کنار حالت مبارزه فراهم می‌کند.",

    features: [
        { title: "🤖 تعداد ربات", value: "۲ عدد" },
        { title: "🎮 کنترل", value: "کنترل از راه دور" },
        { title: "🔄 حرکت", value: "چندجهته و چرخش ۳۶۰ درجه" },
    ],

    specs: [
        { title: "نوع محصول", value: "ست ربات کنترلی دونفره" },
        { title: "تعداد ربات", value: "۲ عدد" },
        { title: "نوع کنترل", value: "بی‌سیم" },
        { title: "حرکت", value: "۳۶۰ درجه و چندجهته" },
        { title: "حالت بازی", value: "بوکس و فوتبال" },
        { title: "منبع انرژی", value: "باتری قابل شارژ" },
        { title: "روش شارژ", value: "USB" },
        { title: "توپ فوتبال", value: "دارد" },
        { title: "دروازه", value: "دارد" },
        { title: "جنس", value: "پلاستیک ABS" }
    ]
},
    ssdmksxxs556sxksksxd: {
        name: "تریلی کانتینربر کنترلی شارژی",
        price: "۱۲,۸۰۰,۰۰۰ تومان",

        image: "../../images/EE_Brand_Rechargeable_Remote_Controlled_Semi_Truck.jpg",

        description: "تریلی بزرگ برای بازی بزرگ! 🚛",

        link: "../../products/product/?id=ssdmksxxs556sxksksxd",

        category: ["remote", "vehicle"],

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "تریلی کانتینربر کنترلی بزرگ و شارژی با طراحی جذاب، چراغ، موزیک و کنترل ۲.۴ گیگاهرتز؛ مناسب علاقه‌مندان به ماشین‌های کنترلی.",

        fullDescription:
            "این تریلی کانتینربر کنترلی بزرگ با طراحی چشمگیر و ابعاد بزرگ، تجربه‌ای جذاب از بازی با خودروهای کنترلی را فراهم می‌کند. 🚛" + "این مدل شارژی دارای باتری، کنترل از راه دور با فرکانس ۲.۴ گیگاهرتز، چراغ و موزیک است و برای بازی و سرگرمی طراحی شده است." + "بدنه بزرگ و طراحی شبیه کامیون‌های واقعی، این محصول را به گزینه‌ای جذاب برای علاقه‌مندان به ماشین‌های کنترلی و وسایل نقلیه تبدیل کرده است.",

        features: [
            {
                title: "🚛 نوع",
                value: "تریلی کانتینربر کنترلی"
            },
            {
                title: "🎮 کنترل",
                value: "کنترل از راه دور"
            },
            {
                title: "📏 ابعاد",
                value: "مدل بزرگ"
            },
        ],

        specs: [
            {
                title: "نوع محصول",
                value: "تریلی کانتینربر کنترلی"
            },
            {
                title: "نوع حرکت",
                value: "کنترلی"
            },
            {
                title: "فرکانس کنترل",
                value: "۲.۴ گیگاهرتز"
            },
            {
                title: "منبع تغذیه",
                value: "باتری و شارژی"
            },
            {
                title: "چراغ",
                value: "دارد"
            },
            {
                title: "موزیک",
                value: "دارد"
            },
            {
                title: "طراحی",
                value: "کامیون کانتینربر"
            }
        ]
    },
    sdw7fc84d6565xc446d5: {
        name: "ست پیست اسکیت و دوچرخه",
        price: "۲,۸۸۰,۰۰۰  تومان",
        image: "../../images/Bicycle_and_skating_track_with_equipment.jpg",

        description: "🛹 هیجان روی پیست!",

        link: "../../products/product/?id=sdw7fc84d6565xc446d5",

        category: ["sport", "educational"],

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "ست پیست اسکیت و دوچرخه با رمپ‌ها و موانع مختلف، مناسب کودکان بالای ۳ سال برای بازی و اجرای حرکات نمایشی.",

        fullDescription:
            "با این ست جذاب، یک پیست کوچک اسکیت و دوچرخه برای اجرای حرکات نمایشی بسازید! 🛹🚲" + "این مجموعه دارای رمپ، پله، نرده و مسیرهای مختلف است و با استفاده از قطعات آن می‌توان مسیرهای متنوعی برای بازی ایجاد کرد." + "این محصول برای کودکان بالای ۳ سال طراحی شده و می‌تواند به تقویت هماهنگی دست و چشم و مهارت‌های حرکتی هنگام بازی کمک کند.",

        features: [
            {
                title: "🛹 نوع",
                value: "ست پیست اسکیت و دوچرخه"
            },
            {
                title: "🏁 پیست",
                value: "دارای مسیر و موانع نمایشی"
            },

            {
                title: "👦 مناسب برای",
                value: "۳ سال به بالا"
            }
        ],

        specs: [
            {
                title: "نوع محصول",
                value: "ست پیست اسکیت و دوچرخه"
            },
            {
                title: "مناسب برای",
                value: "کودکان بالای ۳ سال"
            },
            {
                title: "اقلام",
                value: "دوچرخه، اسکیت‌برد و قطعات پیست"
            },
            {
                title: "موانع",
                value: "رمپ، پله و نرده"
            },
            {
                title: "کاربرد",
                value: "بازی و اجرای حرکات نمایشی"
            }
        ]
    },
    sdw48ds5d45d45w45d44: {
        name: "ماکت موتور CB1300",
        price: "۴,۶۰۰,۰۰۰ تومان",

        images: [
            "../../images/Die_cast_Honda_CB1300_model.jpg",
            "../../images/Die_cast_Honda_CB1300_model2.jpg",
        ],

        description: "قدرت و زیبایی در یک ماکت! 🏍️",

        link: "../../products/product/?id=sdw48ds5d45d45w45d44",

        category: ["figure"],

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "ماکت موتور CB1300 با بدنه تمام‌فلزی، جزئیات ساخت بالا و قابلیت حرکت فرمان و چرخ‌ها.",

        fullDescription:
            "ماکت موتور CB1300 با طراحی زیبا و بدنه تمام‌فلزی، مناسب علاقه‌مندان به موتور و کلکسیونرها 🏍️ فرمان و چرخ‌ها قابلیت حرکت دارند و دو جک نگهدارنده، امکان قرارگیری بهتر ماکت را فراهم می‌کنند. این ماکت با طول حدود ۱۸ سانتی‌متر و ارتفاع حدود ۱۱ سانتی‌متر، همراه با جعبه عرضه می‌شود.",

        features: [
            {
                title: "🏍️ مدل",
                value: "CB1300"
            },
            {
                title: "🔩 جنس",
                value: "تمام فلزی"
            },
            {
                title: "⚙️ قابلیت حرکتی",
                value: "حرکت فرمان و چرخ‌ها"
            },
        ],

        specs: [
            {
                title: "مدل",
                value: "CB1300"
            },
            {
                title: "جنس",
                value: "تمام فلزی"
            },
            {
                title: "طول",
                value: "حدود ۱۸ سانتی‌متر"
            },
            {
                title: "ارتفاع",
                value: "حدود ۱۱ سانتی‌متر"
            },
            {
                title: "جک نگهدارنده",
                value: "۲ عدد"
            },
            {
                title: "قابلیت حرکت",
                value: "فرمان و چرخ‌ها"
            },
        ]
    },
    wdxs54dw4s6d5e64ds1s: {
        name: "ماشین کودک موزیکال",
        price: "۵,۰۰۰,۰۰۰ تومان",
        images: [
            "../../images/Musical_baby_car_with_handle.jpg",
            "../../images/Musical_baby_car_with_handle2.jpg"
        ],
        description: "بازی با کلی موزیک! 🚲🎵",
        link: "../../products/product/?id=wdxs54dw4s6d5e64ds1s",
        category: ["digital", "sport", "educational"],
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "چهارچرخه موزیکال ریلیش مدل مجیکار با اهرم هدایت قابل تنظیم، محافظ صندلی و صندوق زیر صندلی.",

        // توضیحات کامل محصول
        fullDescription:
            "چهارچرخه موزیکال کودک ریلیش مدل مجیکار، محصولی سرگرم‌کننده برای کودکان است که به اهرم هدایت فرمان قابل تنظیم در دو ارتفاع مجهز شده است. روی فرمان یک صفحه موزیکال با بوق و چهار دکمه برای پخش ملودی‌های کودکانه قرار دارد و صندوق زیر صندلی نیز فضای مناسبی برای قرار دادن وسایل کوچک کودک فراهم می‌کند. این چهارچرخه دارای محافظ صندلی و چرخ‌های پلاستیکی است و برای کودکان ۲ تا ۵ سال با ظرفیت وزنی ۲۰ کیلوگرم طراحی شده است.",

        // کارت‌های ویژگی
        features: [
            { title: "🎵 امکانات", value: "موزیکال و بوق" },
            { title: "⚙️ تعداد چرخ", value: "۴ حلقه" },
            { title: "🎚️ اهرم فرمان", value: "قابل تنظیم در ۲ ارتفاع" }
        ],

        // مشخصات محصول
        specs: [
            { title: "نوع محصول", value: "چهارچرخه کودک" },
            { title: "تعداد چرخ", value: "۴ حلقه" },
            { title: "نوع چرخ‌ها", value: "پلاستیکی" },
            { title: "جنس", value: "پلاستیک" },
            { title: "امکانات صوتی", value: "موزیکال، بوق و ۴ ملودی کودکانه" },
            { title: "نحوه کنترل و فرمان", value: "اهرم هدایت فرمان" },
            { title: "تنظیم اهرم فرمان", value: "قابل تنظیم در ۲ ارتفاع" },
            { title: "امکانات ایمنی", value: "محافظ صندلی" },
            { title: "رده سنی", value: "۲ تا ۵ سال" },
            { title: "ظرفیت وزنی", value: "۲۰ کیلوگرم" },
            { title: "ویژگی نوری", value: "ندارد" }
        ]
    },
    dsfe8f45sd5c55sfe44f: {
        name: "لگو کشتی کروز 2428 تکه",
        price: "۸,۵۰۰,۰۰۰ تومان",
        image: "../../images/2,428_Piece_Cruise_Ship_Lego_Set.jpg",
        description: "یک کشتی بزرگ بساز! 🚢",
        link: "../../products/product/?id=dsfe8f45sd5c55sfe44f",
        category: ["educational", "lego"],
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "لگو کشتی کروز Zhe Gao با ۲۴۲۸ قطعه مینی، مناسب ساخت و دکور.",

        // توضیحات کامل محصول
        fullDescription:
            "لگو کشتی کروز از برند Zhe Gao یک مجموعه ساختنی بزرگ و پرجزئیات با ۲۴۲۸ قطعه مینی است. این مدل پس از ساخت حدود ۴۹ سانتی‌متر طول دارد و با جزئیاتی مانند عرشه‌های چندطبقه، قایق‌های نجات، دودکش‌ها و جرثقیل طراحی شده است. این مجموعه علاوه بر سرگرمی ساخت، می‌تواند پس از تکمیل به عنوان یک مدل دکوراتیو و کلکسیونی مورد استفاده قرار گیرد.",

        // کارت‌های ویژگی
        features: [
            { title: "🧩 تعداد قطعات", value: "۲۴۲۸ قطعه" },
            { title: "🚢 نوع", value: "کشتی کروز" },
            { title: "📏 طول محصول", value: "حدود ۴۹ سانتی‌متر" }
        ],

        // مشخصات محصول
        specs: [
            { title: "برند", value: "Zhe Gao" },
            { title: "نوع محصول", value: "لگو و ساختنی" },
            { title: "تعداد قطعات", value: "۲۴۲۸ قطعه" },
            { title: "جنس", value: "پلیمری" },
            { title: "رده سنی", value: "بالای ۶ سال" },
            { title: "اقلام همراه", value: "دفترچه راهنما و پایه نمایش" },
            { title: "کاربرد", value: "ساختنی، سرگرمی و دکور" }
        ]
    },
    ed4554fe8dc54ec45xcd: {
        name: "لگو جیپ کنترلی 314 تکه",
        price: "۴,۶۰۰,۰۰۰ تومان",
        image: "../../images/313_Piece_Remote_Controlled_Car_LEGO_Set.jpg",
        description: "بساز، کنترل کن، لذت ببر! 🚙",
        link: "../../products/product/?id=ed4554fe8dc54ec45xcd",
        category: ["educational", "lego", "remote"],
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "مجموعه ساختنی ۳۱۳ قطعه برای ساخت یک جیپ آفرود کنترلی با ریموت.",

        // توضیحات کامل محصول
        fullDescription:
            "ساختنی ۳۱۳ تکه مدل جیپ کنترلی ، یک مجموعه ساختنی سرگرم‌کننده است که پس از مونتاژ به یک خودروی آفرود کنترلی تبدیل می‌شود. این مجموعه دارای ۳۱۳ قطعه پلاستیکی و ریموت کنترل است و امکان هدایت خودرو را فراهم می‌کند. ساختن مدل و سپس بازی با خودروی ساخته‌شده، تجربه‌ای ترکیبی از سرگرمی و ساختنی برای کودکان و نوجوانان علاقه‌مند به ماشین‌ها ایجاد می‌کند.",

        // کارت‌های ویژگی
        features: [
            { title: "🧩 تعداد قطعات", value: "۳۱۳ قطعه" },
            { title: "🎮 کنترل", value: "ریموت کنترل" },
            { title: "🚙 نوع", value: "جیپ آفرود کنترلی" }
        ],

        // مشخصات محصول
        specs: [
            { title: "نوع", value: "مدل‌سازی و ساختنی" },
            { title: "مدل", value: "جیپ کنترلی" },
            { title: "تعداد قطعات", value: "۳۱۳ قطعه" },
            { title: "جنس", value: "پلاستیک" },
            { title: "اقلام همراه", value: "۳۱۳ قطعه و ریموت کنترل" },
            { title: "نوع کنترل", value: "کنترلی" },
            { title: "مناسب برای", value: "کودکان و نوجوانان" }
        ]
    },
    ds45d454e54d5x4cscsx: {
        name: "موتور کودک مدل وسپی",
        price: "۳,۲۵۰,۰۰۰ تومان",
        image: "../../images/Musical_Vespa_style_ride_on_motorcycle_with_working_lights.jpg",
        description: "یک موتور کوچولو، کلی ماجرا! 🏍️",
        link: "../../products/product/?id=ds45d454e54d5x4cscsx",
        category: ["sport", "digital"],
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "موتور کودک ریلیش مدل وسپی با طراحی جذاب، چراغ و قابلیت پخش موسیقی.",

        // توضیحات کامل محصول
        fullDescription:
            "موتور سواری کودک مدل وسپی با طراحی جذاب و جمع‌وجور، گزینه‌ای سرگرم‌کننده برای کودکان است. این محصول دارای چراغ، قابلیت پخش موسیقی و اهرم هدایت فرمان است و با طراحی چهارچرخ، تعادل مناسبی هنگام بازی فراهم می‌کند. ابعاد جمع‌وجور و وزن حدود ۳ کیلوگرم نیز جابه‌جایی آن را آسان می‌کند.",

        // کارت‌های ویژگی
        features: [
            {
                title: "⚙️ تعداد چرخ",
                value: "۴ چرخ"
            },
            {
                title: "🎵 امکانات",
                value: "موزیکال و چراغ‌دار"
            },
            {
                title: "👶 مناسب برای",
                value: "کودک"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "مدل",
                value: "وسپی"
            },
            {
                title: "نوع محصول",
                value: "موتور سواری کودک"
            },
            {
                title: "تعداد چرخ",
                value: "۴ چرخ"
            },
            {
                title: "جنس چرخ‌ها",
                value: "پلاستیکی"
            },
            {
                title: "امکانات",
                value: "موزیکال و چراغ‌دار"
            },
            {
                title: "نحوه هدایت",
                value: "اهرم هدایت فرمان"
            },
            {
                title: "مناسب برای",
                value: "کودک"
            },
            {
                title: "جنس بدنه",
                value: "پلاستیک"
            }
        ]
    },
    sf74ds561cx3256dxc57: {
        name: "شخصیت پی جی مکس",
        price: "۲,۳۰۰,۰۰۰ تومان",
        image: "../../images/PJ_Masks_character.jpg",
        description: "وقتِ قهرمان‌بازی! 🦸‍♂️",
        link: "../../products/product/?id=sf74ds561cx3256dxc57",
        category: "figure",
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "مجموعه ۹ عددی فیگورهای طرح پی‌جی مکس، مناسب برای بازی، سرگرمی و کلکسیون کودکان.",

        // توضیحات کامل محصول
        fullDescription:
            "این مجموعه شامل ۹ عدد فیگور با طراحی الهام‌گرفته از شخصیت‌های پی‌جی مکس است. فیگورها با ابعاد جمع‌وجور، برای بازی و سرگرمی کودکان طراحی شده‌اند. این مجموعه می‌تواند برای بازی‌های داستانی، سرگرمی و جمع‌آوری فیگورها مورد استفاده قرار بگیرد.",

        // کارت‌های ویژگی
        features: [
            {
                title: "🧩 تعداد",
                value: "۹ عدد"
            },
            {
                title: "🧱 جنس",
                value: "پلاستیک"
            },
            {
                title: "👶 مناسب برای",
                value: "خردسال و کودک"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "نوع محصول",
                value: "فیگور"
            },
            {
                title: "تعداد",
                value: "۹ عدد"
            },
            {
                title: "جنس",
                value: "پلاستیک"
            },
            {
                title: "مناسب برای",
                value: "خردسال و کودک"
            },
            {
                title: "کاربرد",
                value: "بازی، سرگرمی و کلکسیون"
            },
            {
                title: "ابعاد",
                value: "جمع‌وجور"
            }
        ]
    },
    vf8d4v5cx546d5f78v5c: {
        name: "موتور شارژی چراغ دار",
        price: "۷,۳۰۰,۰۰۰ تومان",
        image: "../../images/Rechargeable_motorcycle_with_lights.jpg",
        description: "سواری کوچیک، هیجان بزرگ! 🏍️",
        link: "../../products/product/?id=vf8d4v5cx546d5f78v5c",
        category: ["sport", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "موتور شارژی سه‌چرخ یک وسیله سرگرم‌کننده برای سواری کودکان با طراحی جذاب و کودکانه.",

        fullDescription:
            "این موتور شارژی برای ایجاد تجربه‌ای سرگرم‌کننده از سواری برای کودکان طراحی شده است. طراحی سه‌چرخ آن ظاهر متفاوتی به محصول داده و برای بازی و سرگرمی کودکان مناسب است.",

        features: [
            {
                title: "🏍️ نوع",
                value: "موتور شارژی کودک"
            },
            {
                title: "⚙️ تعداد چرخ",
                value: "۳ چرخ"
            },
            {
                title: "👶 حداقل سن",
                value: "۳ سال"
            }
        ],

        specs: [
            {
                title: "مشخصات این محصول ذکر نشده است.",
                value: ""
            }
        ]
    },
    dfg87546cv1vx32c1vfd: {
        name: "اسکوتر شارژی بلوتوث دار",
        price: "۴۹,۰۰۰,۰۰۰ تومان",
        image: "../../images/Bluetooth_enabled_drifting_electric_scooter.jpg",
        description: "هیجان را به حرکت تبدیل کن! 🛴",
        link: "../../products/product/?id=dfg87546cv1vx32c1vfd",
        category: ["sport", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اسکوتر دریفت ۶۰۰ وات با نورپردازی RGB، باتری ۴۲ ولت و قابلیت بلوتوث و اسپیکر.",

        fullDescription:
            "اسکوتر دریفت با موتور ۶۰۰ وات و باتری ۴۲ ولت، برای تجربه‌ای هیجان‌انگیز طراحی شده است. این مدل دارای نورپردازی RGB و قابلیت پخش صدا از طریق بلوتوث و اسپیکر است. با هر بار شارژ، محدوده پیمایش آن تا حدود ۱۰ کیلومتر اعلام شده است.",

        features: [
            {
                title: "👤 مناسب برای",
                value: "۳ سال به بالا"
            },
            {
                title: "💡 نورپردازی",
                value: "RGB"
            },
            {
                title: "🔋 ولتاژ باتری",
                value: "۴۲ ولت"
            }
        ],

        specs: [
            {
                title: "توان موتور",
                value: "۶۰۰ وات"
            },
            {
                title: "ولتاژ باتری",
                value: "۴۲ ولت"
            },
            {
                title: "محدوده پیمایش",
                value: "تا ۱۰ کیلومتر با هر بار شارژ"
            },
            {
                title: "نورپردازی",
                value: "RGB"
            },
            {
                title: "تحمل وزن",
                value: "تا ۱۲۰ کیلوگرم"
            },
            {
                title: "مناسب برای",
                value: "۳ سال به بالا"
            },
            {
                title: "قابلیت‌ها",
                value: "بلوتوث و اسپیکر"
            }
        ]
    },
    df12vcdr54d6g45sd4fg: {
        name: "لگو شطرنج هری پاتر ۸۷۶ قطعه",

        price: "۶,۵۰۰,۰۰۰ تومان",

        image: "../../images/Harry_Potter_Chess_LEGO__Set_876_Pieces.jpg",

        description: "جادو بساز، شطرنج بازی کن! ♟️",

        link: "../../products/product/?id=df12vcdr54d6g45sd4fg",

        category: "lego",

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "مجموعه ساختنی ۸۷۶ تکه با طرح شطرنج هری پاتر، مناسب ساخت، بازی و کلکسیون.",

        fullDescription:
            "این مجموعه ساختنی ۸۷۶ تکه با طراحی الهام‌گرفته از دنیای هری پاتر، ترکیبی از ساختنی و شطرنج است. پس از ساخت، می‌توانید از صفحه و مهره‌های آن برای انجام بازی شطرنج استفاده کنید و از آن به‌عنوان یک محصول کلکسیونی نیز بهره ببرید.",

        features: [
            {
                title: "🧱 تعداد قطعات",
                value: "۸۷۶ تکه"
            },
            {
                title: "♟️ نوع",
                value: "ساختنی / شطرنج"
            },
            {
                title: "👤 رده سنی",
                value: "بالای ۱۶ سال"
            }
        ],

        specs: [
            {
                title: "تعداد قطعات",
                value: "۸۷۶ تکه"
            },
            {
                title: "نوع",
                value: "ساختنی / شطرنج"
            },
            {
                title: "طرح",
                value: "هری پاتر"
            },
            {
                title: "جنس",
                value: "پلاستیک ABS"
            },
            {
                title: "رده سنی",
                value: "بالای ۱۶ سال"
            },
            {
                title: "چراغ تزئینی",
                value: "دارد"
            },
            {
                title: "کشور سازنده",
                value: "چین"
            }
        ]
    },
    sd56v4cx321fs65df4sc: {
        name: "اسکوتر توربو چراغ دار",

        price: "۶,۶۰۰,۰۰۰ تومان",

        image: "../../images/Light_up_musical_Turbo_scooter.jpg",

        description: "بازی کن، حرکت کن! 🛴",

        link: "../../products/product/?id=sd56v4cx321fs65df4sc",

        category: "sport",

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اسکوتر سه‌چرخ موزیکال مدل توربو با چراغ‌های رنگارنگ و طراحی جذاب کودکانه.",

        fullDescription:
            "اسکوتر سه‌چرخ موزیکال مدل توربو با طراحی جذاب، انتخابی سرگرم‌کننده برای کودکان است. این اسکوتر دارای چراغ‌های رنگارنگ است که همراه با موسیقی روشن و خاموش می‌شوند. طراحی سه‌چرخ و تعادلی آن هنگام بازی تجربه‌ای جذاب و سرگرم‌کننده برای کودکان ایجاد می‌کند.",

        features: [
            {
                title: "🛴 نوع",
                value: "اسکوتر سه‌چرخ کودک"
            },
            {
                title: "🎵 قابلیت",
                value: "موزیکال"
            },
            {
                title: "💡 چراغ",
                value: "چراغ‌های رنگارنگ موزیکال"
            }
        ],

        specs: [
            {
                title: "نوع محصول",
                value: "اسکوتر سه‌چرخ"
            },
            {
                title: "مدل",
                value: "توربو"
            },
            {
                title: "تعداد چرخ",
                value: "۳ عدد"
            },
            {
                title: "نوع طراحی",
                value: "تعادلی"
            },
            {
                title: "قابلیت",
                value: "موزیکال"
            },
            {
                title: "چراغ",
                value: "چراغ‌های رنگارنگ"
            },
            {
                title: "ویژگی حرکتی",
                value: "سه‌چرخ و تعادلی"
            },
            {
                title: "مناسب برای",
                value: "کودکان"
            },
            {
                title: "طراحی",
                value: "زیبا و منحصر به فرد"
            }
        ]
    },
    sdj5ds25cds1cs2dx54c: {
        name: "اسکوتر حرفه ای کوپر",

        price: "۵,۶۰۰,۰۰۰ تومان",

        image: "../../images/Cooper_Professional_Scooter.jpg",

        description: "هیجان بیشتر، حرکت راحت‌تر! 🔥",

        link: "../../products/product/?id=sdj5ds25cds1cs2dx54c",

        category: "sport",

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اسکوتر دوچرخ تاشو با بدنه مقاوم، چرخ‌های ۲۰۰ میلی‌متری و ترمز پایی، مناسب تفریح و استفاده روزمره.",

        fullDescription:
            "اسکوتر حرفه‌ای کوپر دارای بدنه فلزی، دو چرخ ۲۰۰ میلی‌متری، فرمان قابل تنظیم، ترمز پایی و جک است. قابلیت تاشدن این اسکوتر باعث می‌شود حمل و نگهداری آن راحت‌تر باشد و برای تفریح و استفاده روزمره گزینه‌ای کاربردی محسوب می‌شود.",

        features: [
            {
                title: "📏 قطر چرخ",
                value: "۲۰۰ میلی‌متر"
            },
            {
                title: "⚙️ جنس بدنه",
                value: "فلزی / آهنی"
            },
            {
                title: "👤 تحمل وزن",
                value: "تا ۱۰۰ کیلوگرم"
            }
        ],

        specs: [
            {
                title: "جنس بدنه",
                value: "فلزی / آهنی"
            },
            {
                title: "قطر چرخ",
                value: "۲۰۰ میلی‌متر"
            },
            {
                title: "تحمل وزن",
                value: "تا ۱۰۰ کیلوگرم"
            },
            {
                title: "تعداد چرخ",
                value: "۲ عدد"
            },
            {
                title: "جنس چرخ",
                value: "فایبرگلاس سخت ژله‌ای"
            },
            {
                title: "فرمان",
                value: "قابل تنظیم"
            },
            {
                title: "ترمز",
                value: "پایی"
            },
            {
                title: "جک",
                value: "دارد"
            },
            {
                title: "قابلیت تاشو",
                value: "دارد"
            }
        ]
    },
    cx3v21df65v13cx2r2r1: {
        name: "لگو جت جنگنده ۶۴۴ قطعه",

        price: "۲,۵۰۰,۰۰۰ تومان",

        image: "../../images/Fighter_Jet_LEGO_Set.jpg",

        description: "کاملش کن، بهش افتخار کن! ✈️",

        link: "../../products/product/?id=cx3v21df65v13cx2r2r1",

        category: "lego",

        Inventory: "✓ موجود در انبار",

        shortDescription:
            "لگو ۶۴۴ قطعه مدل سوخو-۳۳، یک ساختنی چندمرحله‌ای از جنس ABS با طراحی هواپیما و مناسب علاقه‌مندان به مدل‌های ساختنی.",

        fullDescription:
            "لگو ۶۴۴ قطعه مدل سوخو-۳۳ یک ساختنی جذاب با طراحی هواپیما و تعداد قطعات نسبتاً بالا است. قطعات این مجموعه از پلاستیک ABS ساخته شده‌اند و ساخت مدل به دقت و تمرکز نیاز دارد. پس از تکمیل نیز می‌توان مدل ساخته‌شده را به‌عنوان یک سازه تزئینی نگهداری و نمایش داد.",

        features: [
            {
                title: "✈️ مدل",
                value: "سوخو-۳۳"
            },
            {
                title: "🧩 تعداد قطعات",
                value: "۶۴۴ قطعه"
            },
            {
                title: "👦 رده سنی",
                value: "بالای ۷ سال"
            }
        ],

        specs: [
            {
                title: "مدل",
                value: "سوخو-۳۳"
            },
            {
                title: "تعداد قطعات",
                value: "۶۴۴ قطعه"
            },
            {
                title: "جنس",
                value: "پلاستیک ABS"
            },
            {
                title: "رده سنی",
                value: "بالای ۷ سال"
            },
            {
                title: "وزن",
                value: "تقریبا ۹۳۰ گرم"
            },
            {
                title: "نوع محصول",
                value: "ساختنی و چندمرحله‌ای"
            },
            {
                title: "کاربرد",
                value: "ساخت و نمایش مدل نهایی"
            },
            {
                title: "مهارت‌ها",
                value: "تمرکز و دقت زیاد"
            }
        ]
    },
    ic9dc8djc9wjdw9djsi2: {
        name: "کرم فشاری هالی تویز",
        price: "۳,۲۰۰,۰۰۰ تومان",
        image: "../../images/Hola_Toys_Musical_Push_Down_Worm.jpg",
        description: "بازی کن، بخند و حرکت کن! 🐛",
        link: "../../products/product/?id=ic9dc8djc9wjdw9djsi2",
        category: ["educational", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "کرم خزنده موزیکال هولی تویز با حرکت عقب‌کش، موزیک، چراغ‌های رنگی و چرخ‌های جغجغه‌ای، مناسب کودکان بالای ۶ ماه.",

        fullDescription:
            "کرم خزنده موزیکال هولی تویز با رنگ‌های شاد و طراحی جذاب، برای سرگرمی کودکان خردسال طراحی شده است. این اسباب‌بازی دارای موتور عقب‌کش، پخش موزیک و صدا، چراغ‌های رنگی و چرخ‌های جغجغه‌ای است. همچنین با دو حالت بازی و ساختار پلاستیک ABS، گزینه‌ای سرگرم‌کننده برای کودکان بالای ۶ ماه محسوب می‌شود.",

        features: [
            { title: "🏷️ برند", value: "Hola Toys" },
            { title: "🎵 نوع", value: "کرم خزنده موزیکال" },
            { title: "👶 رده سنی", value: "بالای ۶ ماه" }
        ],

        specs: [
            { title: "برند", value: "Hola Toys" },
            { title: "نوع", value: "کرم خزنده موزیکال" },
            { title: "جنس", value: "پلاستیک ABS" },
            { title: "رده سنی", value: "بالای ۶ ماه" },
            { title: "قابلیت", value: "پخش موزیک و صدا" },
            { title: "نورپردازی", value: "دارای چراغ‌های رنگی" },
            { title: "حرکت", value: "دارای موتور عقب‌کش" },
            { title: "ویژگی حرکتی", value: "چرخ‌های دارای جغجغه" }
        ]
    },
    u456tyhjliu65resxli8: {
        name: "ست مینی فیگور لگو",
        price: "۶۵۰,۰۰۰ تومان",
        image: "../../images/Minecraft_figure.jpg",
        description: "شهر لگویی خودتو بساز! 🏙️",
        link: "../../products/product/?id=u456tyhjliu65resxli8",
        category: ["figure", "lego"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "این ست شامل ۱۰ مینی‌فیگور جذاب با طراحی پرجزئیات و جنس پلاستیک ABS است و برای کودکان بالای ۶ سال مناسب است.",

        fullDescription:
            "این ست مینی‌فیگور لگو شامل ۱۰ عدد مینی‌فیگور با طراحی جذاب و جزئیات مناسب است. فیگورها حدود ۴.۵ سانتی‌متر طول دارند و از پلاستیک ABS ساخته شده‌اند. این مجموعه برای کودکان بالای ۶ سال مناسب است و می‌تواند برای بازی‌های خلاقانه و تکمیل مجموعه‌های لگویی استفاده شود.",

        features: [
            { title: "🧩 تعداد", value: "۱۰ عدد مینی‌فیگور" },
            { title: "🧱 جنس", value: "پلاستیک ABS درجه‌یک" },
            { title: "🎂 مناسب برای", value: "بالای ۶ سال" }
        ],

        specs: [
            { title: "سبک محصول", value: "مینی‌فیگور" },
            { title: "طراحی", value: "پر جزئیات" },
            { title: "نوع استفاده", value: "بازی و کلکسیون" },
            { title: "سبک طراحی", value: "شهری" },
            { title: "نوع فیگورها", value: "مینی‌فیگورهای متنوع" },
            { title: "تعداد فیگورها", value: "۱۰ عدد" },
            { title: "ارتفاع هر فیگور", value: "حدود ۴.۵ سانتی‌متر" },
            { title: "رده سنی", value: "بالای ۶ سال" },
            { title: "جنس", value: "پلاستیک ABS" },
            { title: "مناسب برای", value: "علاقه‌مندان به لگو" }
        ]
    },
    weru89938u9idu093dui: {
        name: "سگ موزیکال هولا تویز",
        price: "۵,۴۰۰,۰۰۰ تومان",
        image: "../../images/Hola_Toys_Musical_Dog.jpg",
        description: "یه دوست بامزه برای بازی! 🌈",
        link: "../../products/product/?id=weru89938u9idu093dui",
        category: ["educational", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "سگ موزیکال هولا تویز با پخش موسیقی و صداهای حیوانات، حرکت سر، گوش‌ها و دم و دکمه‌های تعاملی، مناسب کودکان ۶ ماه به بالا.",

        fullDescription:
            "سگ موزیکال هولا تویز با طراحی بامزه و دوست‌داشتنی، یک اسباب‌بازی سرگرم‌کننده برای کودکان ۶ ماه به بالا است. این اسباب‌بازی با پخش موسیقی و صداهای حیوانات، حرکت سر، گوش‌ها و دم و جلوه‌های نوری کودک را سرگرم می‌کند. دکمه‌های تعاملی و قابلیت‌های مختلف آن نیز بازی را جذاب‌تر کرده و کودک را به تعامل و کشف بیشتر تشویق می‌کند.",

        features: [
            { title: "🐶 برند", value: "Hola Toys" },
            { title: "🎵 قابلیت", value: "پخش موسیقی و صداهای حیوانات" },
            { title: "💡 ویژگی", value: "نورهای ملایم و چشمک‌زن" }
        ],

        specs: [
            { title: "مشخصات این محصول ذکر نشده است.", value: "" },
        ]
    },
    s93eixwodke3w9idwso9: {
        name: "لگو سیتی پلیس خارجی",
        price: "۳,۰۰۰,۰۰۰ تومان",
        image: "../../images/LEGO_City_Police_(International_Version).jpg",
        description: "شهر پلیسی خودت را بساز! 🚓",
        link: "../../products/product/?id=s93eixwodke3w9idwso9",
        category: "lego",
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "مجموعه ساختنی City Police با ۵۴۴ قطعه، نقشه ساخت و طراحی پلیس شهری، مناسب کودکان بالای ۶ سال.",

        fullDescription:
            "لگو سیتی پلیس خارجی یک مجموعه ساختنی جذاب با طرح پلیس شهری است که از ۵۴۴ قطعه تشکیل شده است. این محصول دارای نقشه ساخت است و امکان ساخت یک مجموعه با موضوع City Police را فراهم می‌کند. این مجموعه برای کودکان بالای ۶ سال طراحی شده و می‌تواند سرگرمی همراه با ساخت و بازی را فراهم کند.",

        features: [
            { title: "🧩 تعداد قطعات", value: "۵۴۴ قطعه" },
            { title: "📖 دارای", value: "نقشه ساخت" },
            { title: "👦 مناسب", value: "کودکان بالای ۶ سال" }
        ],

        specs: [
            { title: "تعداد قطعات", value: "۵۴۴ قطعه" },
            { title: "دارای", value: "نقشه ساخت" },
            { title: "مناسب", value: "کودکان بالای ۶ سال" },
            { title: "نوع", value: "ساختنی / لگو" },
            { title: "طرح", value: "پلیس شهری" },
            { title: "برند / مدل", value: "LX" }
        ]
    },
    ddxwsdwd0iw032elkw2s: {
        name: "لگو موتور کاوازاکی H2R",
        price: "۴,۳۰۰,۰۰۰ تومان",
        image: "../../images/LEGO_Kawasaki_H2R_Motorcycle.jpg",
        description: "بساز، لذت ببر، افتخار کن ✨!",
        link: "../../products/product/?id=ddxwsdwd0iw032elkw2s",
        category: "lego",
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "لگو موتور Kawasaki Ninja H2R با ۶۴۳ قطعه ABS و طراحی جذاب و پرجزئیات، مناسب علاقه‌مندان به موتور و ساختنی‌ها.",

        fullDescription:
            "لگو موتور Kawasaki Ninja H2R با طراحی جذاب و جزئیات نزدیک به موتور واقعی، یک مجموعه ساختنی هیجان‌انگیز است. این مجموعه شامل ۶۴۳ قطعه از پلاستیک ABS است و برای ساخت آن دفترچه راهنما نیز ارائه شده است. این محصول برای افراد بالای ۱۰ سال مناسب است و می‌تواند سرگرمی جذابی برای علاقه‌مندان به موتور، ساخت‌وساز و مدل‌های مکانیکی باشد.",

        features: [
            { title: "🏍️ مدل", value: "Kawasaki Ninja H2R" },
            { title: "🧩 تعداد قطعات", value: "۶۴۳ قطعه" },
            { title: "👦 مناسب", value: "بالای ۱۰ سال" }
        ],

        specs: [
            { title: "مشخصات این محصول ذکر نشده است.", value: "" },
        ]
    },
    euj992e9xxoj3293uedx: {
        name: "ست میز آرایشی کامل",
        price: "۲,۵۰۰,۰۰۰ تومان",
        image: "../../images/Complete_vanity_set.jpg",
        description: "کوچولوت، یه آرایشگر حرفه‌ای! 💄",
        link: "../../products/product/?id=euj992e9xxoj3293uedx",
        category: "makeup",
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "میز آرایش کودک با آینه موزیکال و چراغ‌دار، سشوار و ۶ تکه لوازم جانبی؛ مناسب بازی کودکان بالای ۳ سال.",

        fullDescription:
            "میز آرایش کودک یک ست جذاب برای بازی و خاله‌بازی کودکان است. این میز دارای آینه موزیکال و چراغ‌دار، دو در آینه با باز و بسته‌شدن توسط مادون قرمز، یک کشو و سشوار با قابلیت باد زدن است. همچنین شامل صندلی، رژ، لاک، دستبند، انگشتر، کش مو و شانه است و برای کودکان بالای ۳ سال طراحی شده است.",

        features: [
            { title: "🎀 نوع", value: "میز آرایش کودک" },
            { title: "👧 مناسب برای", value: "کودکان بالای ۳ سال" },
            { title: "🧩 تعداد", value: "سرویس ۶ تکه میز آرایش" }
        ],

        specs: [
            { title: "آینه", value: "دارای آینه با دو در" },
            { title: "نور و صدا", value: "دارای چراغ و موزیک" },
            { title: "قابلیت پخش", value: "امکان اتصال به MP3 Player" },
            { title: "سشوار", value: "دارای دکمه و قابلیت باد زدن" },
            { title: "کشو", value: "دارد" },
            { title: "باتری میز", value: "۳ عدد باتری قلمی" },
            { title: "باتری سشوار", value: "۲ عدد باتری قلمی" },
            { title: "اقلام همراه", value: "یک صندلی" }
        ]
    },
    xrfl43n4w3kn3wfk3kme: {
        name: "شخصیت های پپاپیگ ۲۵ تایی",
        price: "۳,۵۰۰,۰۰۰ تومان",
        image: "../../images/Pepapic_Family_Set.jpg",
        description: "🐷 دنیای پپا رو بساز! 🎀",
        link: "../../products/product/?id=xrfl43n4w3kn3wfk3kme",
        category: ["educational", "figure"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "مجموعه ۲۵ عددی فیگور پپا پیگ با شخصیت‌های متنوع، دست‌وپای متحرک و سرهای سیلیکونی نرم؛ مناسب بازی و داستان‌سازی کودکان.",

        fullDescription:
            "با مجموعه ۲۵ عددی فیگور پپا پیگ شخصیت‌های محبوب این کارتون را کنار هم داشته باشید و دنیای داستانی کودکانه بسازید. فیگورها از پلاستیک ساخته شده‌اند و سرهای سیلیکونی نرم دارند؛ همچنین دست‌ها و پاهای آن‌ها قابلیت حرکت دارند. این مجموعه می‌تواند برای بازی خلاقانه، داستان‌سازی و سرگرمی کودکان استفاده شود.",

        features: [
            { title: "🎭 مدل", value: "خانواده پپا / ۲۵ تایی" },
            { title: "🔢 تعداد", value: "۲۵ عدد فیگور" },
            { title: "🎨 نوع", value: "فیگور شخصیت‌های پپا پیگ" }
        ],

        specs: [
            { title: "تعداد", value: "۲۵ عدد فیگور" },
            { title: "جنس بدنه", value: "پلاستیک" },
            { title: "جنس سر", value: "سیلیکونی نرم" },
            { title: "قابلیت حرکتی", value: "حرکت دست‌ها و پاها" },
            { title: "کشور تولیدکننده", value: "چین" }
        ]
    },
    fdvdxvcew9rwoj3ee02e: {
        name: "هواپیما کنترلی",
        price: "۳,۲۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-35.jpg",
        description: "پروازی هیجان‌انگیز و سرگرم‌کننده ✈️",
        link: "../../products/product/?id=fdvdxvcew9rwoj3ee02e",
        category: ["remote", "action"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "هواپیمای کنترلی STORM WARPLANE یک اسباب‌بازی پروازی با طراحی الهام‌گرفته از جنگنده‌های نظامی است و همراه با ریموت کنترل عرضه می‌شود.",

        fullDescription:
            "هواپیمای کنترلی STORM WARPLANE با طراحی ظاهری شبیه جنگنده‌های هوایی ساخته شده است. این محصول دارای ریموت کنترل برای هدایت هواپیماست و برای بازی و سرگرمی طراحی شده است.",

        features: [
            { title: "✈️ نوع", value: "هواپیمای کنترلی" },
            { title: "🎮 کنترل", value: "دارای ریموت کنترل" },
            { title: "🛩️ طراحی", value: "جنگنده / هواپیمای نظامی‌نما" }
        ],

        specs: [
            { title: "مشخصات این محصول ذکر نشده است.", value: "" }
        ]
    },
    dpkpe3ed3k0edpwd33ed: {
        name: "بوکسینگ شارژی بلوتوث",
        price: "۵,۲۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-33.jpg",
        description: "مبارزه هیجان‌انگیز با بلوتوث 🥊",
        link: "../../products/product/?id=dpkpe3ed3k0edpwd33ed",
        category: ["action", "digital", "sport"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "دستگاه بوکس موزیکال هوشمند دیواری با ۳ حالت تمرینی، ۳ سطح سرعت و قابلیت اتصال بلوتوث، مناسب استفاده در خانه.",

        fullDescription:
            "دستگاه بوکس موزیکال هوشمند دیواری یک وسیله سرگرم‌کننده و ورزشی برای استفاده در خانه است که با پخش موسیقی، تمرین بوکس را جذاب‌تر می‌کند. این مدل دارای ۳ حالت تمرینی و ۳ سطح قابل تنظیم سرعت است و امتیاز ضربات را به‌صورت لحظه‌ای نمایش می‌دهد. نصب آن بدون سوراخ‌کاری انجام می‌شود و به‌همراه دستکش مخصوص بوکس ارائه می‌شود. همچنین قابلیت اتصال به بلوتوث دارد و برای کودکان و بزرگسالان طراحی شده است.",

        features: [
            { title: "🥊 حالات تمرینی", value: "۳ حالت متنوع" },
            { title: "⚡ تنظیمات سرعت", value: "۳ سطح قابل تنظیم" },
            { title: "🎧 اتصال", value: "بلوتوث دارد" }
        ],

        specs: [
            { title: "برند سازنده", value: "Ark miido" },
            { title: "حالات تمرینی", value: "۳ حالت متنوع" },
            { title: "تنظیمات سرعت", value: "۳ سطح قابل تنظیم" },
            { title: "متعلقات همراه", value: "دستکش مخصوص بوکس" },
            { title: "نوع نصب", value: "بدون سوراخ‌کاری" },
            { title: "کاربرد اصلی", value: "تناسب اندام خانگی" },
            { title: "مناسب برای", value: "کودکان و بزرگسالان" },
            { title: "قابلیت اصلی", value: "نمایشگر لحظه‌ای امتیاز" },
            { title: "جنس بدنه", value: "مقاوم و باکیفیت" },
            { title: "قابلیت تنظیم ارتفاع", value: "دارای طراحی انعطاف‌پذیر" },
            { title: "تغذیه دستگاه", value: "باتری شارژی" },
            { title: "قابلیت اتصال به بلوتوث", value: "دارد" }
        ]
    },
    w2se8dyhwsdi8jwwdiu8: {
        name: "تفنگ ۲ کاره توپی و آبپاش",
        price: "۲,۵۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-25.jpg",
        description: "دو بازی در یک تفنگ جذاب 🎯",
        link: "../../products/product/?id=w2se8dyhwsdi8jwwdiu8",
        category: "action",
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اسباب‌بازی آب‌پاش و توپ‌پرتاب‌کن با طراحی سبک و سرگرم‌کننده، مناسب بازی و تفریح کودکان در فضای باز.",

        fullDescription:
            "این اسباب‌بازی آب‌پاش و توپ‌پرتاب‌کن، گزینه‌ای سرگرم‌کننده برای بازی و تفریح کودکان در فضای باز است. طراحی جذاب و استفاده آسان آن باعث می‌شود کودکان بتوانند در بازی‌های گروهی و سرگرمی‌های تابستانی از آن لذت ببرند. همراه داشتن توپ‌های نرم نیز تنوع بیشتری به بازی می‌دهد و آن را به انتخابی مناسب برای اوقات فراغت تبدیل می‌کند.",

        features: [
            { title: "🧱 جنس", value: "پلاستیک ABS نشکن" },
            { title: "👦 مناسب سنین", value: "۷ سال به بالا" },
            { title: "💦 نوع مکانیزم", value: "آبپاش" }
        ],

        specs: [
            { title: "جنس", value: "پلاستیک ABS نشکن" },
            { title: "نوع تیر", value: "آبپاش" },
            { title: "نوع مکانیزم", value: "آبپاش" },
            { title: "جنس بدنه پوکه", value: "پلاستیک نشکن" },
            { title: "تعداد توپ‌های هدف‌گیری", value: "۶ عدد" },
            { title: "تعداد هدف", value: "۳ عدد" },
            { title: "ساخت", value: "چین" }
        ]
    },
    f45s6r4e54fv5hf454b4: {
        name: "ست نجاری دلر باتری خور",
        price: "۳,۰۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-22.jpg",
        description: "ست ابزار جذاب و سرگرم‌کننده 🔨",
        link: "../../products/product/?id=f45s6r4e54fv5hf454b4",
        category: "tools",
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "یک ست ابزار اسباب‌بازی جذاب برای کودکان که امکان بازی و شبیه‌سازی فعالیت‌های مهندسی و فنی را فراهم می‌کند. برای سرگرمی و تقویت خلاقیت و مهارت‌های دستی مناسب است.",

        // توضیحات کامل محصول
        fullDescription:
            "این مجموعه با داشتن ابزارهای متنوع، تجربه‌ای سرگرم‌کننده از بازی‌های فنی و مهندسی برای کودکان ایجاد می‌کند. کودک می‌تواند با ابزارهای موجود به ساخت‌وساز و بازی‌های خلاقانه بپردازد. طراحی این محصول برای بازی‌های نقش‌آفرینی و سرگرمی در خانه مناسب است.",

        // کارت‌های ویژگی
        features: [
            {
                title: "🧒 مناسب رده سنی",
                value: "کودکان"
            },
            {
                title: "🔧 نوع محصول",
                value: "ست ابزار اسباب‌بازی"
            },
            {
                title: "🎁 نوع بازی",
                value: "ساختنی و نقش‌آفرینی"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "ابعاد",
                value: "۴۲۰×۳۰۰×۵۰ میلی‌متر"
            },
            {
                title: "سبک",
                value: "سرگرم‌کننده"
            },
            {
                title: "سایر توضیحات",
                value: "شامل ۱۵ ابزار - دارای دریل"
            },
            {
                title: "مناسب رده سنی",
                value: "بالای ۳ سال"
            },
            {
                title: "جنس",
                value: "پلاستیک با کیفیت"
            },
            {
                title: "منبع تغذیه دریل",
                value: "۲ عدد باتری قلمی"
            },
            {
                title: "کشور سازنده",
                value: "چین"
            }
        ]
    },
    fse6rf45e4g8v454v5vd: {
        name: "کنسول بازی ۵۰۰ بازی",
        price: "۳,۰۰۰,۰۰۰ تومان",
        images: ["../../images/photo_2026-09-13_22-49-28.jpg", "../../images/photo_2026-09-13_22-49-28_2.jpg"],
        description: "گیم‌پد شارژی با ۵۰۰ بازی متنوع 🎮",
        link: "../../products/product/?id=fse6rf45e4g8v454v5vd",
        category: ["console", "digital"],
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "کنسول بازی جذاب با گیم‌پد شارژی و مجموعه‌ای از ۵۰۰ بازی متنوع و سرگرم‌کننده.",

        // توضیحات کامل محصول
        fullDescription:
            "کنسول بازی ۵۰۰ بازی یک انتخاب جذاب برای علاقه‌مندان به بازی‌های کلاسیک و سرگرم‌کننده است. این محصول دارای گیم‌پد شارژی بوده و مجموعه‌ای از بازی‌های متنوع را در اختیار شما قرار می‌دهد.",

        // کارت‌های ویژگی
        features: [
            {
                title: "🎮 تعداد بازی",
                value: "۵۰۰ بازی متنوع"
            },
            {
                title: "📺 اتصال",
                value: "قابل اتصال به تلویزیون"
            },
            {
                title: "🔋 کنترلر",
                value: "شارژی"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "نوع محصول",
                value: "کنسول بازی"
            },
            {
                title: "نوع کنترلر",
                value: "شارژی"
            },
            {
                title: "خروجی‌ها",
                value: "تلویزیون"
            },
            {
                title: "تعداد بازی",
                value: "۵۰۰ عدد"
            },
            {
                title: "مناسب برای",
                value: "کودکان و نوجوانان"
            },
            {
                title: "تعداد دکمه",
                value: "۱۲ دکمه"
            },
            {
                title: "ظرفیت",
                value: "۱۰۲۰ میلی‌آمپر"
            },
            {
                title: "باتری سازگار",
                value: "لیتیومی"
            },
            {
                title: "سایر توضیحات",
                value: "دارای بازی داخلی، دارای ولوم صدا"
            },
            {
                title: "درگاه کارت حافظه",
                value: "ندارد"
            },
            {
                title: "اندازه صفحه نمایش",
                value: "۳ اینچ"
            },
            {
                title: "محتویات",
                value: "کابل تصویر، کابل شارژر"
            },
            {
                title: "صفحه‌نمایش لمسی",
                value: "ندارد"
            },
            {
                title: "فضای ذخیره‌سازی",
                value: "ندارد"
            }
        ]
    },
    df8g74df5gd123dg6465: {
        name: "ست بافت مو",
        price: "۱,۵۰۰,۰۰۰ تومان",
        image: "../../images/Untitled-1.png",
        description: "ست جذاب برای بافت مو 🎀",
        link: "../../products/product/?id=df8g74df5gd123dg6465",
        category: "makeup",
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "ست بافت مو، مناسب برای ایجاد مدل‌های متنوع و جذاب مو در خانه.",

        // توضیحات کامل محصول
        fullDescription:
            "ست بافت مو مجموعه‌ای جذاب و سرگرم‌کننده برای ایجاد مدل‌های متنوع بافت مو است. این ست با داشتن لوازم مورد نیاز، امکان تجربه و ساخت مدل‌های مختلف را فراهم می‌کند.",

        // کارت‌های ویژگی
        features: [
            {
                title: "🎀 کاربرد",
                value: "بافت و حالت‌دهی مو"
            },
            {
                title: "🧰 محتویات",
                value: "مجموعه ابزار بافت مو"
            },
            {
                title: "✨ کاربرد",
                value: "مناسب برای مدل‌های مختلف بافت"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "نیاز به همراهی بزرگسال",
                value: "بدون نیاز به همراه"
            },
            {
                title: "درجه سختی",
                value: "آسان"
            },
            {
                title: "مناسب رده سنی",
                value: "۶ تا ۱۰ سال"
            },
            {
                title: "نوع محصول",
                value: "لوازم آرایشی"
            },
            {
                title: "وزن",
                value: "350 گرم"
            },
            {
                title: "منبع انرژی",
                value: "باتری نیم‌قلمی"
            },
            {
                title: "اقلام همراه",
                value: "3 عدد قرقره نخ - چند عدد کش"
            }
        ]
    },
    fh8g7h5fh42gb2g4h545: {
        name: "ست ناخن و ارایشی",
        price: "۲,۳۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-19.jpg",
        description: "ست جذاب ناخن 💅",
        link: "../../products/product/?id=fh8g7h5fh42gb2g4h545",
        category: "makeup",
        Inventory: "✓ موجود در انبار",

        // توضیح کوتاه زیر نام محصول
        shortDescription:
            "ست استمپر ناخن کرومی، یک مجموعه سرگرم‌کننده برای طراحی و تزئین ناخن است که امکان ایجاد طرح‌های متنوع و جذاب را فراهم می‌کند."
        ,
        // توضیحات کامل محصول
        fullDescription:
            "این اسباب بازی یک ست جذاب و پرطرفدار طرح کرومی برای تزیین ناخن کودکان است که شامل دستگاه چاپ ناخن یا استمپر و لوازم آرایشی مصرفی استاندارد کودک می‌باشد. طراحی ایمن و سرگرم‌کننده این مجموعه، تجربه‌ای شاد و خلاقانه را برای کودکان فراهم می‌کند.",

        // کارت‌های ویژگی
        features: [
            {
                title: "👧 مناسب رده سنی",
                value: "۶ سال به بالا"
            },
            {
                title: "✨ درجه سختی",
                value: "آسان"
            },
            {
                title: "🎁 تعداد قطعات",
                value: "۱۴ عدد"
            }
        ],

        // مشخصات محصول
        specs: [
            {
                title: "گروه جنسیت",
                value: "دخترانه"
            },
            {
                title: "رده سنی",
                value: "کودک و نوجوان"
            },
            {
                title: "ابعاد جعبه",
                value: "۳۹ × ۷ × ۲۵ سانتی‌متر"
            },
            {
                title: "تعداد قطعات",
                value: "۱۴ قطعه"
            },
            {
                title: "تعداد لاک",
                value: "۳ عدد"
            },
            {
                title: "تعداد رول",
                value: "۲ عدد"
            },
            {
                title: "کشور سازنده",
                value: "چین"
            }
        ]
    },
    mje8is3ur3883wiikdx3: {
        name: "دوربین عکاسی چاپ‌دار",
        price: "۴,۸۰۰,۰۰۰ تومان",
        image: "../../images/photo_2026-09-13_22-49-30.jpg",
        description: "لحظه‌ها را ثبت و چاپ کن 📸",
        link: "../../products/product/?id=mje8is3ur3883wiikdx3",
        category: ["digital", "educational"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "دوربین عکاسی چاپ سریع با رزولوشن ۱۲ مگاپیکسل، صفحه‌نمایش ۲.۴ اینچی و قابلیت چاپ سریع عکس، مناسب ثبت و چاپ لحظه‌های خاطره‌انگیز.",

        fullDescription:
            "دوربین عکاسی چاپ سریع با رزولوشن ۱۲ مگاپیکسل، وسیله‌ای سرگرم‌کننده برای ثبت لحظه‌های روزمره است. این دوربین با طراحی کوچک و سبک، جابه‌جایی و استفاده از آن را آسان می‌کند. قابلیت چاپ سریع عکس‌ها تجربه‌ای متفاوت و جذاب هنگام عکاسی ایجاد می‌کند و امکان فیلمبرداری، پخش فیلم و موزیک و استفاده از فیلتر و فریم عکس را نیز دارد.",

        features: [
            { title: "📸 رزولوشن", value: "۱۲ مگاپیکسل" },
            { title: "🖨️ قابلیت", value: "چاپ سریع عکس" },
            { title: "🎒 طراحی", value: "کوچک و قابل حمل" }
        ],

        specs: [
            { title: "اندازه صفحه نمایش", value: "۲.۴ اینچ" },
            { title: "امکانات", value: "عکسبرداری، فیلمبرداری، MP3 PLAYER" },
            { title: "رزولوشن فیلمبرداری", value: "۱۰۸۰ × ۱۹۲۰" },
            { title: "اقلام همراه", value: "بند نگهدارنده، رول پرینت اضافه" },
            { title: "درگاه شارژ", value: "TYPE-C" },
            { title: "رزولوشن عکسبرداری", value: "۱۲ مگاپیکسل" },
            { title: "درگاه رم", value: "دارد" },
            { title: "قابلیت پخش فیلم و موزیک", value: "دارد" },
            { title: "فیلتر و فریم عکس", value: "دارد" }
        ]
    },
    edr9efds54f48er4f2d5: {
        name: "اتوبوس آموزشی هالی تویز",
        price: "۶,۸۰۰,۰۰۰ تومان",
        image: "../../images/Holly_Toys_educational_bus.jpg",
        description: "اموزش حروف و اعداد انگلیسی 🚍",
        link: "../../products/product/?id=edr9efds54f48er4f2d5",
        category: ["educational", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اتوبوس موزیکال آموزشی هولی تویز با ۴ حالت آموزشی و موزیکال، آموزش حروف انگلیسی و اعداد ۱ تا ۱۰ و قابلیت پخش صدا و موسیقی.",

        fullDescription:
            "این اتوبوس با پخش موسیقی و صدا، یادگیری حروف الفبای انگلیسی و اعداد ۱ تا ۱۰ را برای کودک جذاب‌تر می‌کند. دارای چهار حالت آموزشی شامل حروف و اعداد، مثال‌های الفبا، پرسش‌وپاسخ و پخش موسیقی است. همچنین با دکمه Go می‌توان بین سه مقصد مختلف با موسیقی‌های متفاوت انتخاب کرد.",

        features: [
            { title: "🚌 برند", value: "Hola Toys" },
            { title: "🎵 قابلیت", value: "۴ حالت آموزشی و موزیکال" },
            { title: "🔤 آموزش", value: "حروف انگلیسی و اعداد ۱ تا ۱۰" }
        ],

        specs: [
            { title: "برند", value: "Hola Toys" },
            { title: "جنس", value: "پلاستیک با کیفیت" },
            { title: "جلوه‌های نوری و صوتی", value: "دارد" },
            { title: "منبع تغذیه", value: "۲ عدد باتری قلمی" },
            { title: "ساخت", value: "چین" }
        ]
    },
    wds8jdi8wsjsi982sj2w: {
        name: "اردک برند هالی تویز",
        price: "۳,۵۰۰,۰۰۰ تومان",
        image: "../../images/Hulie_Toys_brand_duck.jpg",
        description: "اردک موزیکال؛ شادیِ کودکانه 🐥",
        link: "../../products/product/?id=wds8jdi8wsjsi982sj2w",
        category: ["educational", "digital"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "اسباب‌بازی آموزشی هولی تویز مدل Yellow Duck با صدا، نور و حرکت، کودک را به دنبال کردن و بازی کردن تشویق می‌کند.",

        fullDescription:
            "اسباب‌بازی آموزشی هولی تویز مدل Yellow Duck یک اردک موزیکال و حرکتی است که با صدا، نور و حرکت، کودک را به دنبال کردن و بازی کردن تشویق می‌کند. با فشار دادن دکمه‌های مختلف، صداهای اردک، موسیقی و افکت‌های صوتی پخش می‌شوند و چراغ‌های روی اسباب‌بازی روشن می‌شوند. با فشردن دکمه بالای سر اردک، اسباب‌بازی به‌صورت خودکار حرکت می‌کند و هنگام حرکت چشم‌ها، منقار و بال‌ها نیز تکان می‌خورند. همچنین هنگام برخورد با مانع، می‌تواند جهت حرکت خود را تغییر دهد.",

        features: [
            { title: "🚌 برند", value: "Hola Toys" },
            { title: "💡 افکت", value: "نور و صدا" },
            { title: "🔋 باتری", value: "۳ عدد باتری AA" }
        ],

        specs: [
            { title: "برند", value: "Hola Toys" },
            { title: "جنس", value: "پلاستیک با کیفیت" },
            { title: "جلوه‌های نوری و صوتی", value: "دارد" },
            { title: "منبع تغذیه", value: "۳ عدد باتری AA" },
            { title: "نوع", value: "اسباب‌بازی موزیکال و حرکتی" },
            { title: "حرکت", value: "حرکت خودکار به جلو و عقب" }
        ]
    },
    fd454rf1de45wr9f44re: {
        name: "ربات بازلایتر موزیکال",
        price: "۲,۸۰۰,۰۰۰ تومان",
        image: "../../images/Musical_Buzz_Lightyear_Robot.jpg",
        description: "به سوی بی‌نهایت و فراتر از آن! 🤖",
        link: "../../products/product/?id=fd454rf1de45wr9f44re",
        category: ["action", "digital", "figure"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "فیگور موزیکال و چراغ‌دار Buzz Lightyear با جلوه‌های نوری و صوتی، لیزر و مفاصل حرکتی، مناسب طرفداران Toy Story.",

        fullDescription:
            "بازلایتر موزیکال و چراغ‌دار از شخصیت محبوب Toy Story طراحی شده و برای بازی‌های تخیلی و سرگرم‌کننده کودکان مناسب است. این فیگور دارای موسیقی، جلوه‌های نوری و لیزر با افکت صوتی است و مفاصل حرکتی در دست، آرنج و زانو دارد. طراحی این محصول با الهام از شخصیت Buzz Lightyear انجام شده و می‌تواند برای طرفداران داستان اسباب‌بازی‌ها گزینه‌ای جذاب برای بازی یا هدیه باشد.",

        features: [
            { title: "🤖 شخصیت", value: "Buzz Lightyear" },
            { title: "💡 افکت", value: "نور و صدا" },
            { title: "🎵 قابلیت", value: "موزیکال" }
        ],

        specs: [
            { title: "شخصیت", value: "Buzz Lightyear" },
            { title: "قابلیت", value: "موزیکال" },
            { title: "جلوه‌های نوری و صوتی", value: "دارد" },
            { title: "لیزر", value: "دارد" },
            { title: "مفاصل حرکتی", value: "دست، آرنج و زانو" },
            { title: "جنس", value: "پلاستیک با کیفیت" },
            { title: "رده سنی", value: "۳ سال به بالا" },
            { title: "باتری", value: "نیاز دارد" }
        ]
    },
    sesc8dfced5s8cfe48es: {
        name: "ست بوکسینگ دیجیتال شارژی",
        price: "۸,۰۰۰,۰۰۰ تومان",
        image: "../../images/Rechargeable_Digital_6_Piece_Boxing_Set.jpg",
        description: "واکنش نشون بده و لذت ببر! 🥊",
        link: "../../products/product/?id=sesc8dfced5s8cfe48es",
        category: ["action", "digital", "sport"],
        Inventory: "✓ موجود در انبار",

        shortDescription:
            "بوکس هوشمند موزیکال با ۶ نقطه ضربه‌پذیر، نورپردازی، موسیقی و افکت صوتی؛ مناسب بازی و فعالیت بدنی.",

        fullDescription:
            "🥊 کیسه بوکس دیواری هوشمند موزیکال یک اسباب‌بازی تعاملی و سرگرم‌کننده برای تمرین و بازی است. این محصول دارای ۶ نقطه ضربه‌پذیر با نورپردازی متغیر است که با ایجاد نورهای راهنما، بازی را هیجان‌انگیزتر می‌کند. وجود اسپیکر داخلی، موسیقی و افکت‌های صوتی باعث می‌شود تجربه بازی جذاب‌تر شود. همچنین با طراحی تعاملی خود می‌تواند به تقویت تمرکز، سرعت واکنش و افزایش تحرک بدنی کمک کند. 🥊⚡",

        features: [
            { title: "🎯 نقاط ضربه‌پذیر", value: "۶ نقطه" },
            { title: "🎮 نوع بازی", value: "تعاملی" },
            { title: "🔋 منبع تغذیه", value: "باتری داخلی قابل شارژ" }
        ],

        specs: [
            { title: "نقاط ضربه‌پذیر", value: "۶ نقطه" },
            { title: "نورپردازی", value: "دارد" },
            { title: "پخش موسیقی", value: "دارد" },
            { title: "افکت صوتی", value: "دارد" },
            { title: "نوع بازی", value: "تعاملی" },
            { title: "منبع تغذیه", value: "باتری داخلی قابل شارژ" },
            { title: "روش شارژ", value: "کابل USB" },
            { title: "نحوه نصب", value: "دیواری" },
            { title: "کمک به", value: "تمرکز و سرعت واکنش" }
        ]
    },

};

export { products };
